Revit 2026 API

# ViewportGetLabelOutline Method

---

Gets the outline viewport's label on the sheet.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Outline GetLabelOutline()
```
```vb
Public Function GetLabelOutline As Outline
```
```cpp
public:
Outline^ GetLabelOutline()
```
```fsharp
member GetLabelOutline : unit -> Outline
```

#### Return Value

Outline The outline of the viewport's label on the sheet. The outline may be empty if there is no label.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | The viewport is not on a sheet. |

#### Reference

Viewport Class

Autodesk.Revit.DB Namespace